{
  "beginner": [
    {
      "accuracy_rate": "~98%",
      "pose": "Cobra Pose",
      "description": "Bhujangasana, also known as the Cobra Pose, is a heart-opening backbend that extends your entire upper body and might be helpful if you're suffering from upper back stiffness, shoulder tightness, or back pain. By bending or straightening your elbows, you may simply change the backbend's intensity to fit your demands.\n\nIt is customary to perform this pose at the start of class as a warm-up and preparation for more challenging backbends.",
      "youtube_link": "https://www.youtube.com/watch?v=n6jrC6WeF84",
      "instructions": "1. Lie on your belly, with the chin on the floor, palms flat on the floor under the shoulders and legs together.\n\n2. Pull up the knee caps, squeeze the thighs and buttocks, engage mula bandha, and press the pubic bone down into the floor.\n\n3. Without using the arms, inhale and lift the head and chest off of the floor, keeping the neck in line with the spine.\n\n4. With the elbows close to your sides, press down into the palms and use the arms to lift you up even higher. Drop the shoulders down and back and press the chest forward. Keep the legs, buttocks, and mula bandha strong, and keep the pubic bone pressing down into the floor.\n\n5. Breathe and hold for 2-6 breaths.\n\n6. To release: exhale and slowly lower the chest and head to the floor. Turn the head to one side and rest, rock the hips from side to side to release any tension in the low back."
    },
    {
      "accuracy_rate": "~84%",
      "pose": "Mountain Pose",
      "description": "Despite its seeming simplicity, Tadasana (Mountain Pose) is a crucial pose for your yoga practice. It is regarded as the starting point for many other standing yoga positions.\n\nIn reality, there is a lot going on in this deceptively simple position. In the Mountain Pose, your palms should be facing forward as you stand tall with your feet parallel to the ground and your arms at your sides. This pose encourages strong posture since it calls for you to maintain your shoulders open and down, away from your ears. Tadasana's uplifting qualities also increase steadiness.",
      "youtube_link": "https://www.youtube.com/watch?v=2HTvZp5rPrg",
      "instructions": "1. Stand with the feet a few inches apart and parallel. (Alternatively, you can stand with your heels slightly apart and the bases of your big toes touching.\n\n2. Lift and spread your toes and the balls of your feet, then gently place them back on the floor. Rock gently from side to side and back again. Gradually bring the swaying to a stop, distributing your weight equally across your feet. Feel the energy rising through your core from your feet.\n\n3. Spread your collarbones and lift the top of your sternum straight up toward the sky without pulling your lower front ribs forward. Let your shoulder blades draw inward and away from your ears as they descend the back would be best.\n\n4. Place your arms at your sides with the palms facing either inward or outward.\n\n5. Your tongue should be wide and flat on the floor of your mouth, your throat should be soft, and the crown of the head should be directly over the center of your pelvis. Relax your gaze. Breathe."
    },
    {
      "accuracy_rate": "~89%",
      "pose": "Upward Salute",
      "description": "Although at first look Urdhva Hastasana (Upward Salute) may appear to be one of the simplest yoga postures, it actually takes concentration and attention. It is a foundation stance for all standing poses, including Tadasana (Mountain Pose), Vrksasana (Tree Pose), Utkatasana (Chair Pose), and movements like Surya Namaskar (Sun Salutation).\n\nIn the upward salute, you learn to lengthen from the ground up by strengthening your arms and shoulders while lengthening from your side waist. As you lift your arms over your head and ground through your feet, consciously investigate the opposing forces at work. When you close your eyes, you can feel the power in your body and know that the ground is there to support you completely. As you breathe in and out, you can feel the energy flowing up and down your spine. Anxiety and stress can be reduced by paying close attention to your breathing as you get ready for the rest of your asana practice or your day.",
      "youtube_link": "https://www.youtube.com/watch?v=0hVRGlraSnQ",
      "instructions": "1. Standing with a modest distance between your heels and your big toes. With your heels, outside edges of your feet, and big-toe mounds, dig down. With your inner arches, raise yourself.\n\n2. In order to release your tailbone toward your heels, rotate your inner thighs backwards.\n\n3. Pull your shoulders back, relax your front ribs, stack your head's crown above your pelvis, and lift your chin so it is parallel to the ground.\n\n4. Raise your arms overhead, palms facing one another and hands spaced shoulder-distance apart.\n\n5. Bring your arms up to meet your ears. Allow your shoulder blades to rise and travel away from your spine by rotating your biceps back.\n\n6. Reach up and touch your palms, then look at your thumbs if you can maintain your arms straight.\n\n7. After taking several breaths, let go of your arms."
    },
    {
      "accuracy_rate": "~82%",
      "pose": "Standing Forward",
      "description": "Start in a mountain position Your feet are around hip-width apart, and your knees are bent. Take a deep, full breath in, and with your breath out start folding up and over the legs. You may use your hands to slowly inch down to the knees, shins, or ankles. Letting go of our shoulders, head, and neck is hard. Pay extra attention to letting go of every part of your body, especially the upper body. If you feel gripping of the back of the leg, bend the knees even deeper. Take a few breaths, roll out of the position, and back into your mountain pose. Repeat this three more times. This position creates a great deal of flexibility in the spine. It also aids digestion and reduces the abdomen in how the belly rests on top of your thighs.",
      "youtube_link": "https://www.youtube.com/watch?v=0kOOvLPN23Q",
      "instructions": "1. Start out with your hands at your hips in Tadasana (Mountain Pose) at the front of the mat.\n\n2. With your torso folded over your legs and your knees slightly bent, hinge from your hips rather than your lower back.\n\n3. Your hands might touch the ground in front of you or next to your feet.\n\n4. To lengthen your spine, inhale and lift your chest.\n\n5. Exhale and slowly straighten both legs without hyperextending them. Gently spiral your upper and inner thighs back while lifting your kneecaps.\n\n6. Extend your torso downward without curving your back as you exhale. Draw your shoulders down your back toward your hips as you lengthen your neck, stretching the crown of your head downward."
    }
  ],
  "intermediate": [
    {
      "accuracy_rate": "~80%",
      "pose": "Balancing Table",
      "description": "Balancing Table Top Pose brings a sense of balance and strengthens the core muscles, hips, lower back, and spine. This is a beginner’s pose and can be done by everyone. Its a modern era yoga pose that can be used by yoga teachers as a transit pose in vinyasa flows.",
      "instructions": "1. On your hands and knees in Table pose, inhale the right leg up parallel to the floor, reaching the toes towards the back wall.  \n\n2. Starring at a point between the palms, slowly inhale the left arm up parallel to the floor, reaching the fingers towards the front wall.\n\n3. Breathe and hold for 3-6 breaths.\n\n4. To release: slowly exhale the left arm down, and then lower the knee down, back into table position.\n\n5. Repeat on other side.",
      "youtube_link": "link"
    },
    {
      "accuracy_rate": "~77%",
      "pose": "Cat Pose",
      "description": "The Cat-Cow Stretch (Chakravakasana) is a yoga essential and for good reason. It involves moving the spine from a rounded position (flexion) to an arched one (extension). Each movement is done in conjunction with either an inhalation or exhalation of the breath, making this a simple vinyasa (linking breath to movement).",
      "instructions": "1. Begin Tabletop with your hips directly over your knees. Your hands should be shoulder-distance apart and slightly ahead of your shoulders. The wrist creases should be parallel to the front of the mat.\n\n2. Press down firmly through your hands.\n\n3. Exhale and round your spine toward the ceiling. Drop the crown of your head and your tailbone. Draw your lower belly in and up.\n\n4. Push the floor away with your hands to broaden across your shoulder blades.\n\n5. Keep the hips over your knees and your arms straight to keep the movement in your spine.\n\n6. To release the pose, return to a neutral spine.",
      "youtube_link": "link"
    },
    {
      "accuracy_rate": "~69%",
      "pose": "Cow Pose",
      "description": "Bitilasana (Cow Pose), a backbend, is commonly paired with Marjaryasana (Cat Pose) at the beginning of a vinyasa flow to warm up your body—especially your spine—for other poses. Cow helps relieve tension in your upper body, especially in your back, shoulders, and neck, and it gently massages the spine to increase mobility.",
      "youtube_link": "link",
      "instructions": "1Begin on your hands and knees in table pose, with a neutral spine. As you inhale and move into cow pose, lift your sit bones upward, press your chest forward and allow your belly to sink.\n\n2. Lift your head, relax your shoulders away from your ears, and gaze straight ahead.\n\n3. As you exhale, come into cat pose while rounding your spine outward, tucking in your tailbone, and drawing your pubic bone forward.\n\n4. Release your head toward the floor — just don’t force your chin to your chest. Most importantly, just relax."
    },
    {
      "accuracy_rate": "~97%",
      "pose": "Table Top Pose",
      "description": "Table pose is a beginner-intermediate yoga pose and a restorative posture. It can help relax the spine and open the chest to help the practitioner breathe more deeply.\n\nIn this asana, the practitioner kneels on all fours. The knees are aligned under the hips, and the hands under the shoulders. The back stays flat, with the head and neck aligned with the spine.",
      "youtube_link": "link",
      "instructions": "1. Come to the floor on your hands and knees. Bring the knees hip-width apart, with the feet directly behind the knees. Bring the palms now under the shoulders with the fingers facing forward.\n\n2. Look down between the palms and allow the back to be flat. Press into the palms to drop the shoulders slightly away from the ears. Press the tailbone towards the back wall and the crown of the head towards the front wall to lengthen the spine.\n\n3. Breathe deeply and hold for 1-3 breaths."
    }
  ],
  "advanced": [
    {
      "accuracy_rate": "~92%",
      "pose": "Warrior 1",
      "description": "Warrior 1 Pose is a standing yoga pose that helps build focus, power and stability. This foundational pose stretches the front side of the body and is great for building strength in the legs, core and back.",
      "youtube_link": "link",
      "instructions": "1. From High Lunge pose with the right knee bent, engage the legs to ground down through the feet, and inhale the hands up to the bent knee. Use the arms to draw the torso back slightly. Make sure the right knee is directly over the right ankle.\n\n2. Bring the hands to the hips and square the hips and the shoulders to the front wall. Relax the shoulders down and draw the shoulderblades towards the spine to open the chest.\n\n3. Inhale the arms over the head in a H position with the palms facing each other, or bring the palms together crossing the thumbs, or interlace the fingers together and point the index finger up. Keep the shoulders relaxed and the chest lifted.\n\n4. To go deeper, bring the palms together, carefully arch back, and look up towards the ceiling.\n\n5. Inhale deeply into the belly and chest, exhale press into the feet, fingers and crown, feeling your body expanding out in 5 directions.\n\n6. Keep breathing and hold for 3-6 breaths.\n\n7. To release, exhale and lower the hands down to the floor."
    },
    {
      "accuracy_rate": "~91%",
      "pose": "Warrior 2",
      "description": "Warrior 2 Pose is a standing strength pose meant to energize the body and mind, increasing concentration and stamina. The posture strengthens the legs as it opens up the chest and hips.",
      "youtube_link": "link",
      "instructions": "1. From Five Pointed Star,  turn the right toe to the right wall and bend the right knee directly over the right ankle.\n\n2. Turn the hips and the shoulders towards the front and reach out through the fingertips, reaching towards the side walls. Turn and look at the right middle finger.\n\n3. Press into the feet, keeping the legs strong. Sink the hips down towards the floor, and reach the crown of the head up to lengthen the spine. Relax the shoulders down and back, pressing the chest forward.\n\n4. Breathe and hold for 3-6 breaths.\n\n5. To release: straighten the legs and turn the feet forward coming back into 5 pointed stars."
    },
    {
      "accuracy_rate": "~94%",
      "pose": "Warrior 3",
      "description": "Warrior 3 Pose is considered an intermediate balancing yoga pose that creates stability throughout your entire body. It utilizes all of the muscles throughout your core, arms and legs. The position improves balance, posture and full-body coordination while it strengthens the whole back side of the body.",
      "youtube_link": "link",
      "instructions": "1. From Mountain pose, step the right foot a foot lengths forward and shift all of your weight onto this leg.\n\n2. Inhale the arms over your head and interlace the fingers, pointing the index finger up.\n\n3. As you exhale, lift the left leg up and out, hinging at the hips to lower the arms and torso down towards the floor.\n\n4. Look down at the floor and stare at a point for balance. Reach out through the left toes and the crown and fingers making one straight line.\n\n5. Breathe and hold for 2-6 breaths.\n\n6. To release: inhale the arms up to lower the leg back to the floor and step both feet together back into Mountain pose.\n\n7. Repeat on the other side."
    }
  ]
}